code/app/views/brackets/selectteams.html.erb

SELECT `teams`.* FROM `teams` ORDER BY `teams`.`school_name` ASC
SELECT `teams`.* FROM `teams`
---
                <%= select_tag("topl_ids[]", options_for_select(@teams), prompt: @prompts[i]) %>
                <%-# collection_select(:team, :topl_1, Team.all.order(:school_name), :id, :school_name) %>
                <%-# collection_select(:team, :topl_1, @teams, :id, :school_name, prompt: 'Select 1 Seed') %>
                <%-# select_tag(:topl_1, options_from_collection_for_select(Team.all, :id, :school_name)) %>