code/app/views/teams/show.html.erb

    <strong>Owner: </strong>
    <%= @team.participant.first_name + ' ' + @team.participant.last_name %>
---
SELECT  `participants`.* FROM `participants` WHERE `participants`.`id` = 5 LIMIT 1