code/app/controllers/brackets_controller.rb

  def selectteams
    @teams = Team.all
---
SELECT `teams`.* FROM `teams`

  def activateteams
    # creates SQL statement similar to the following:
    # UPDATE Participants SET playing = true where id IN participant_ids[];
    Participant.update_all(playing: false)
---
UPDATE `participants` SET `participants`.`playing` = 1 WHERE `participants`.`id` IN (2, 3, 4, 5, 6, 7, 10, 11)