code/app/controllers/brackets_controller.rb

SELECT `brackets`.* FROM `brackets`
---
  def index
    @brackets = Bracket.all

SELECT `participants`.* FROM `participants`
---
  def selectparticipants
    @participants = Participant.all

SELECT `teams`.* FROM `teams` ORDER BY `teams`.`school_name` ASC
SELECT `regions`.* FROM `regions` ORDER BY `regions`.`region` ASC
---
  def selectteams
    # @teams = Team.all.order(:school_name)
    # @teams = Team.all.map{ |t| [ t.school_name, t.id ] }
    # holds the team name and team id to be used in the select fields
    @teams = Team.all.order(:school_name).map{ |t| [ t.school_name, t.id ] }
    # @regions_options = Region.all.order(:region).map{ |r| [ r.region, r.id ] }
    @regions_options = Region.all.order(:region) #.map{ |r| [ r.region, r.id ] }

UPDATE `participants` SET `participants`.`playing` = 1 WHERE `participants`.`id` IN (2, 3, 10, 11)
---
  def activateparticipants
    # creates SQL statement similar to the following:
    # UPDATE Participants SET playing = false
    Participant.update_all(playing: false)

UPDATE `teams` SET `teams`.`playing` = 1 WHERE `teams`.`id` IN (267, 246, 90, 1, 159, 37, 182, 136, 343, 283, 53, 96, 271, 62, 65, 114)
---
  def activateteams
    # create SQL statement
    # UPDATE Teams SET playing = true where id IN team_ids[]
    Team.update_all(playing: false)

SELECT  `brackets`.* FROM `brackets` WHERE `brackets`.`id` = 0 LIMIT 1
---
    def set_bracket
      @bracket = Bracket.find(params[:id])