code/app/views/participants/show.html.erb

SELECT `teams`.* FROM `teams` WHERE `teams`.`participant_id` = 5
---
<h2>Teams</h2>
<% @participant.teams.each do |team| %>