app/controllers/participants_controller.rb

SELECT `participants`.* FROM `participants`
---
  def index
    @participants = Participant.all

INSERT INTO `participants` (`first_name`, `last_name`, `short_name`, `phone_number`, `email`, `image_file`, `playing`, `created_at`, `updated_at`) VALUES ('Kevin', 'Jacks', 'kevin', '1234567890', 'me@kevin.com', '', 1, '2016-08-05 03:51:19', '2016-08-05 03:51:19')
---
  def create
    @participant = Participant.new(participant_params)

    respond_to do |format|
      if @participant.save

UPDATE `participants` SET `last_name` = 'Lannister', `short_name` = 'Cersei', `phone_number` = '3456780912', `email` = 'queen@kingdom.com', `updated_at` = '2016-08-06 05:51:36' WHERE `participants`.`id` = 10
---
  def update
    respond_to do |format|
      if @participant.update(participant_params)

DELETE FROM `participants` WHERE `participants`.`id` = 1
---
  def destroy
    @participant.destroy

SELECT  "participants".* FROM "participants" WHERE "participants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_participant
      @participant = Participant.find(params[:id])