app/controllers/teams_controller.rb

INSERT INTO `teams` (`school_name`, `short_name`, `image_file`, `conference`, `mascot`, `seed`, `division`, `playing`, `created_at`, `updated_at`) VALUES ('University of Wisconsin', 'Wisconsin', '/img/wisconsin.jpg', 'Big 10', 'Badgers', 2, 'East', 1, '2016-07-30 03:43:58', '2016-07-30 03:43:58')
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

UPDATE "teams" SET "school_name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["school_name", "University of Wisconsin"], ["updated_at", 2016-07-28 02:47:10 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @team.update(team_params)